import { addList } from './js/playlist.js';

import modalActivator from './js/modalActivator.js';

import traficLight from './js/traficLight.js';

// *Створити сторінку, що показує нумерований список пісень:

addList();

// *Створити HTML-сторінку з кнопкою "Відкрити" і модальним вікном. На модальном вікні повинен бути текст і кнопка "Закрити". Спочатку модальне вікно не відображається. При кліку на кнопку "Відкрити" з'являється модальне вікно, на кнопку "Закрити" — зникає.

modalActivator();

// *Створити HTML-сторінку зі світлофором і кнопкою, яка перемикає світлофор на наступний колір.

traficLight();
